[
  {
    "id": 1,
    "img": "millennial.png",
    "alt": "millenial logo",
    "title": "Changes in Transition",
    "body" :
"<p>There is no doubt that the transition from adolescence to adulthood is taking longer on average than in the past. In the article <em>Changes in the transition to adulthood in the UK and Canada: the role of agency in emerging adulthood</em> by James Côté and John M. Bynner (2008), the authors present arguments stating the reason for this prolonged transition is not a freely chosen postponement of commitments characterised by a new conception of development, proposed by Jeffrey Arnett in 2000, rather it is a consequence of social and economic conditions in developed countries, more specifically, in Canada and the UK. This article is persuasive, informative, and therefore successful at explaining some of the reasons for the prolonged transition into adulthood because of the professional tone and overall empathy of the authors and the abundant use of statistics throughout the article.</p><p>The professional tone of this article can be seen in the ways Côté and Bynner empathize with Arnett. The authors state through this article that they are voicing their \"scepticism about the utility and applicability of the EA (Emerging Adulthood)\" (Côté and Bynner, 252), however are empathetic and understanding to those who have adopted this EA model because those who adopt the EA model realise \"the transition to adulthood has changed and are looking for a useful metaphor for what is different from the past.\" (Côté and Bynner, 252) This professional tone can also be seen in the ways in which the authors disagree with Arnett, then accompany said disagreements with facts. One opposition that Côté and Bynner have with Arnett's EA model is that it implies that this prolonging of transition into adulthood started only recently. (Côté and Bynner, 253-254) Côté and Bynner state that this prolonging has been \"occurring in much of its present form throughout the latter half of the twentieth century.\" (Côté and Bynner, 254) The two authors then cite two articles written in 1995 stating that the transition time to adulthood is increasing, and has been increasing, followed by one written in 2007 by Warren Clark stating these transitions have been \"'changed or delayed' since 1971\". (Côté and Bynner, 254) Côté and Bynner do an excellent job refuting Arnett's arguments in a professional and empathetic way, thus increasing the persuasiveness of the article.</p><p>The use of statistics in this article reinforces the informative nature of this article. Côté and Bynner argue that the extended transition to adulthood has much to do with the circumstances and experiences of the individual. (Côté and Bynner, 256) Côté and Bynner proceed to support this claim by referring to the series of British cohort studies: the National Survey of Health. Two figures are shown presenting the impact that the academic success of the parents have on the child’s likeliness to achieve a university or college degree and the child's likeliness to experience a temporary suspension from school, respectively. This collected data directly serves to illustrate the ways in which extended transition to adulthood is affected by the circumstances to which the current generation is exposed. Côté and Bynner also state that young people are not choosing to \"evade adult commitments\" but are waiting \"until these commitments can be responsibly made from a position of financial security\" (Côté and Bynner, 259) Once again, this claim is backed up by looking at the average individual annual income in 2004 collected by Statistics Canada in 2006. Upon viewing this data, it can be noted that the average income of those in their early twenties is below the poverty line in a city with a population of 500,000 or more. (Côté and Bynner, 259) Once again, this fact directly serves to defending the argument that young people are subject to their circumstances. Côté and Bynner provide highly relevant and accredited statistics to support their arguments, demonstrating the article is indeed, to a high degree, informative.</p><p>James Côté and John M. Bynner's article <em>Changes in the transition to adulthood in the UK and Canada: the role of agency in emerging adulthood</em> presents many arguments against a new developmental stage called Emerging Adulthood. I believe this article is highly successful at arguing against such a conception due to the professional tone that Côté and Bynner have when opposing Arnett and the informative use of facts and statistics to support their beliefs. This article is well worth the read if you are a young person trying to formulate arguments against older generations about your lack of motivation to start being an adult.</p>" 
  },
  {
    "id": 2,
    "img": "neighbourhood.png",
    "alt": "neighbourhood watch logo",
    "title": "Neighbourhood Poverty",
    "body": "<p>There are many amazing educators in developed countries that want the very best for their students, especially those living in the so-called “rough” neighbourhoods of the city. It is apparent to educators that these students are indeed affected by something, and many believe it to be the rough neighbourhood itself, yet would seldom look for relevant research on the topic. The article <em>Neighbourhood Poverty and Adolescent Development</em> by Velma McBride Murry, Cady Berkel et al. aims to do just that, examine the studies conducted on the effects of neighbourhood poverty on adolescents. This article is effective because it is well organized and it brings relevant issues about the correlation between adolescent development and the environment in which they are raised to light.</p><p>The organization of this article can be seen in its structure. The article mentions six topics that have been studied to be associated with neighbourhood poverty. Each of these topics are addressed in detail per the introduction (Murry et al., 114), and examine the research, where applicable, of both the direct and indirect consequences of these topics. Such topics include adolescent identity development and academic achievement (Murry et al., 114). Furthermore, in each section, the authors swiftly dive into the research for the topics at hand, or boldly claim that research in a particular topic is lacking and should be made a priority among these researchers (Murry et al., 115). This structure, along with the disinclination of the authors to state their opinions on the research, allowing the prevailing knowledge of the topic, or lack thereof, to speak for itself adds to the effectiveness of the article.</p><p>The insight this article provides is unarguably important for all current and aspiring educators. There is a definite stereotype, whether true or not, in the western world that teaching students from poverty stricken areas can prove to be challenging. This article offers insights into the prevailing research depicting the reasons for such difficulties. According to the article, we see that research on the effects of the influence of neighbourhood poverty on adolescents’ academic achievement is uncertain (Murry et al., 117). These facts provide reasons for educators to look for research about the correlation between academic achievement and the neighbourhood in which the adolescents live. One such example is an article by Jean Anyon that examines the classroom experience of students who go to school in poverty stricken areas versus students to attend schools in more wealthy neighbourhoods. This hopeful call to action along with the insight into current research about the connection between poverty and adolescent development emphasize the effectiveness of the article.</p><p><em>Neighbourhood Poverty and Adolescent Development</em> by Murry et al is effective in its attempt to review studies conducted about the interrelationship between adolescent development and neighbourhood poverty. This is due to the article’s structure of review and the insights it provides for educators. This article is an amazing source of knowledge for those aspiring to be teachers.</p><h1 style='text-align: center; margin-top: 100px'>References</h1><p>Anyon, J. (1980). Social class and the hidden curriculum of work. The Journal of Education, 162(1), 67-92.</p>" 
  },
  {
    "id": 3,
    "img": "segregation.png",
    "alt": "segregation logo",
    "title": "Racial Segregation",
    "body": "<p>Canadians are often proud of the multicultural country in which they reside; many of us hoping, and some of us believing, that we have all but abolished racism. Mary E. Thomas’ article <em>‘I think it’s just natural’: the spatiality of racial segregation at a US high school</em> is centred around the discourse and actions of high school girls, showing that racism, typically of the form of racial segregation, is present even if it is present in unconscious manners. The article is effective in illustrating the unconscious bias of many through the lens of these girls because of the comparisons made with other prevalent research about segregation of different forms and the raw, recorded discourse these girls have with Thomas.</p> <p>In the introduction, Thomas makes reference to Butler, comparing Butler’s idea of performative gender with that of racism, stating “I understand race to be a performative that ‘does not merely refer, but acts in some way to constitute that which it enunciates.’” (Thomas, 1233) This proves to be effective due to the plethora of comparisons that can be made, throughout history, with racism and sexism. Thomas also makes reference Kobayashi and Peake who “insist that past landscapes established today’s racist normalization (Kobayashi and Peake, 2000)” (Thomas, 1239). This idea is evident though the conversations with Lucinda and Alice, who have normalized acknowledging the racial difference between the ‘black girl’ and the ‘white girl’ (Thomas, 1241), and through the conversation with Joy who does not know why their cafeteria room is segregated during lunch hour (Thomas, 1238). Unconscious segregation can begin to be dealt with only after a conscious effort is made to acknowledge the segregation, a point which Thomas effectively makes through the use of other’s research.</p><p>The impressive influence of this article comes from the recorded discourse that Thomas provides. Through this discourse, we can see students like Joy and Bryana do not even acknowledge the segregation as a racial issue (Thomas, 1237). This contrasts with students like Faith and Kelli who propagate racist images and are vocal about potential violence towards members of the opposite race. (Thomas, 1245). This discourse provides insight into the thoughts and actions of the girls from the US high school. The important discourse here is the unconscious segregation that takes place with students like Joy and Bryana. Blatant racism is easier to deal with by nature of it being obviously wrong.  The idea that unconscious racism proves to be more challenging to address because either one or both of the parties see nothing wrong is a cornerstone of the effectiveness of Thomas’ article.</p><p>As developed nations, the United States and Canada are far from the eradication of racism. Mary E. Thomas’ article <em>‘I think it’s just natural’: the spatiality of racial segregation at a US high school</em> proves the aforementioned statement with remarkable effectiveness though the use of research conducted in similar fields and the use of verbatim conversations with high school girls. I argue that through these girls, we can speak about the many due to the observation about the power past landscapes have on racism made by Kobayashi and Peake. If there is a temptation to argue about the immaturity of these high school girls, Kobayashi and Peake’s statement indicates it was learned. This acknowledgement is important if developing countries want to stand a chance against the ever losing battle of segregation.</p>"
  },
  {
    "id": 4,
    "img": "calvin.jpg",
    "alt": "Calvin with scrunched face from Calvin and Hobbes",
    "renderImg": "candh-09-19-1986.jpg",
    "renderImgAlt": "Calvin and Hobbes comic strip from 09-19-1986 by Bill Watterson",
    "title": "Calvin and Hobbes",
    "body": "<p>When studying and reflecting on adolescent development, six year olds typically do not make the best subjects, but Calvin is an exception. Calvin is a six year old, highly intelligent boy with an overly vivid imagination and has a knack for getting into trouble. Created by Bill Watterson in the 1980s, Calvin from Calvin and Hobbes serves to be a marvellous example of what can go on in the minds of adolescents. I argue that the above comic strip from September 19, 1986 accurately portrays a developing adolescent through the depiction of Calvin’s developing cognitive thinking and relationship with his mother.</p><p>Calvin, as a six year old child, is seen thinking about what is possible instead of what would be real in his stage of life. Calvin expresses his desire to grow a beard like the band members from ZZ Top. This desire suggests that Calvin is thinking in abstract ways. The members from ZZ Top are all males, and two of the three members do indeed have chest-length beards. Calvin is able to make the connection between his biological gender and the biological genders of the band members: if they share the same biological gender, and the band members have beards, then Calvin should be able to grow a beard. This process of thinking is fitting for developing adolescents, therefore it is evident that Calvin is portraying such youth.</p><p>Calvin’s relationship with his mother is also typical of growing youth, and can be seen through the comic strip. Calvin tells his mother that he has decided to grow a beard, but not just any beard, a beard “like the guys in ZZ Top.” ZZ Top is a rock band. Calvin is insinuating that he wants to be more like the guys from the rock band, which stereotypically leads to rebellious behaviour. This type of question is most likely to get a reaction out of his mother, evident in the last box of the comic where Calvin states that he “thought she’d put up more of a fuss than that.” Trying to elicit a squabble with his mother is indicative of one of the broad conclusions of adolescent development according to Steinberg and Morris, namely that there is a “genuine increase in bickering and squabbling between parents and teenagers during the early adolescent years” (Steinberg & Morris, 88). Trying to raise controversy through suggesting rebellious behaviour implies that Calvin is accurately portraying the stereotypical teenager.</p><p>The comic strip above does a magnificent job at portraying qualities of adolescent development through a six year old comic string character. According to lecture, two ways in which cognitive thinking develops, which is a necessity during adolescent development, are adolescents becoming able to think about what is possible and think about abstract things. Calvin does both of these things, along with adhering to the general consensus that adolescents and parents tend to bicker more often. Therefore, Calvin is an accurate study subject for adolescent development.</p>"
  },
  {
    "id": 5,
    "img": "love.png",
    "alt": "The Chinese character for love, 愛",
    "renderVideo": "https://youtu.be/VoP0ox_Jw_w",
    "title": "What Kind of Asian are you?",
    "body": "<p>According to lecture, the goal of adolescent development is determining the answer to the question “Who am I?” Answering this question, that is, finding your identity, is a long process. Adolescents try on many identity hats, but most notably for racial minorities, the hat of race and culture. This process of finding your identity, and consequently the process of adolescent development, can be hindered by many things, but the focus will be on racism. The poem by Alex Dang, recited at the 2013 national poetry slam in Boston, entitled “What kind of Asian are you?” achieves its intended goal of bringing to light the destructive power of racial categorization through the ongoing poetical pursuit of individuality.</p><p>Alex Dang begins his poem with a question that one can assume is asked often of him, “What kind of Asian are you?” A typical response would be to give a country, whether it’s a country of your birth or the country of your ancestors. Through his poem, Alex Dang expresses that a simple answer like that is not enough. The person who asked the question expects Alex Dang to be a particular type of Asian not based on culture or country of origin, but based on popular Asian figures, stereotypes and misconceptions. Alex Dang responds by stating it’s a “loaded question. What kind of Asian do you expect me to be?” (Dang, 0:13) This response hones in on the issue that the mere expectation of whoever asked Alex Dang the perplexing question puts him in a position of racial assimilation. Moreover, the assumption that all Asian cultures are the same, elicits a strong reaction from Alex Dang, saying “Like how every time you lump an Asian person into one culture it’s systematically making us assimilate into an America we thought was better than our war torn home.” (Dang, 2:02) According to Susan Harter, “Adolescents begin to view themselves in terms of personal beliefs and standards.” (Morris, 91) If trends such as expecting all Asians to have similar culture persist, it can and will impede adolescent development of those who have any traits typical of Asian descent. Clearly, there is tremendous a power that a seemingly harmless question can have on an adolescent trying to find their identity.</p><p>Unconscious racial assimilation in the minds of those who do not share that race is a dangerous reality. The poem “What kind of Asian are you?” by Alex Dong bring this terror to light in a bold way. The poem realizes this goal through Alex Dong’s amazing story of finding an identity amidst all of the pressures to fit into an existing notion of Asian. If as an educator that is not privy to the first hand experiences of racial assimilation you want a way to empathize with these issues, you should listen to this slam poem.</p>"
  },
  {
    "id": 6,
    "img": "millennial.png",
    "alt": "millenial logo",
    "renderVideo": "https://youtu.be/vudaAYx2IcE",
    "title": "The Millennial Question",
    "body": 
"<p>It is difficult, in present times, to think about adolescent development without thinking about millennials. Furthermore, it is difficult to think about millennials without listing words such as entitled, unfocused and lazy. Simon Sinek, in this video entitled “The Millennial Question”, attempts to answer the question of how leaders should manage millennials. This video is interesting because it views millennials in a new and refreshing light, but also generalizes an entire generation regarding how they act.</p><p>Too often, millennials are put down by the older generations, and Simon Sinek attempts to name why this happens. Simon Sinek turns the conversation around and indeed recognizes that many millennials do indeed have these characteristics, but of no fault of their own. Simon lists four reasons millennials could be tough to manage: parenting, technology, impatience, and environment (Sinek, 1:14) Many of these reasons agree with content taught in lecture, for example, environment. Simon Sinek’s point with environment is that “we put [millennials] in corporate environments that care more about the numbers than they do about the kids.” (Sinek, 10:34) This relates with what was taught in lecture about the rise in credentialism and the fact that full time jobs paying living wage are scarce. Companies that care more about the money than about the millennials will naturally not invest the time and money that used to be invested in training the new employee, and simply find candidates that are more qualified to fill the role. It is refreshing that Simon Sinek is taking a lot of the blame off the current generation of millennials and recognizing that the companies and previous generations complaining about millennials were and are a part of the issue. </p><p>This video is great, hitting on many points that millennials should hear; however, Simon Sinek seems hasty to generalize and entire generation of youth to the youth that he has been exposed to. There are many millennials that were not constantly told as children that “they could have anything they wanted” or were taught the amazing virtue of patience yet still have traits of the average millennial. Similarly there are many millennials that meet all four criteria and should be tough to manage, yet are not. It should also be noted that everything Simon Sinek is speaking about most probably comes from personal experience, which would explain the lack of factual or statistical evidence to back up any of the claims he makes about the generation at large. This indeed adds to the interesting nature of the video.</p><p>Addressing issues about millennials is always tough due to the social stigma around the generation, not to mention the fact that it is an entire generation. Simon Sinek’s video entitled “The Millennial Question” is an intriguing video, and most definitely worth the watch if you are a millennial, or someone simply trying to understand the generation in a deeper fashion, due to the new perspective concerning the generation while noting the generalizations that appear throughout the video.</p>"
  },
  {
    "id": 7,
    "img": "classclown.png",
    "alt": "Smiling clown picture",
    "renderPoem": "They'd be all like, never say never<br/>in classes we had, but whatever.<br/>I turned to the windows and hallways<br/>that always said always say always.<br/><footer style='margin-top: 10px'>- Class Clown by Pino Conuccio</footer>",
    "title": "Class Clown",
    "body":
"<p>The poem “Class Clown” by Pino Coluccio does a fantastic job at illustrating the realities of what it is like to be an adolescent in today’s culture. As the poem is read, one can get a sense of a distant, unengaged adolescent in the classroom, whose teacher is instilling some form of general knowledge or life advice: “never say never.” This advice is useless without context, and through the poem, one can note that “they” would “all” say “never say never”. This implies that this time is no different: general advice given out of context. This distant and unengaged temperament is often seen as troublesome, which typically becomes associated with puberty. In lecture it was discussed that this is definitely not always the case. As a result, the student in the poem turns to “the windows and the hallways”, turns to life outside the classroom to seek freedom. This searching is met with the same vagueness of advice, the hallways that say “always say always”. This could symbolise the sheltered environment that adolescents can grow up in, adults around them always protecting them from the harsh realities of the world they must one day join. Reading closely, one can note a sense of searching, searching for a sense of self, for an identity.</p>"
  }

]
