[
  {
    "id": 1,
    "img": "/img/millennial.png",
    "title": "Critical Reflection 1: Changes in Transition",
    "body" :
"<p>There is no doubt that the transition from adolescence to adulthood is taking longer on average than in the past. In the article <em>Changes in the transition to adulthood in the UK and Canada: the role of agency in emerging adulthood</em> by James Côté and John M. Bynner (2008), the authors present arguments stating the reason for this prolonged transition is not a freely chosen postponement of commitments characterised by a new conception of development, proposed by Jeffrey Arnett in 2000, rather it is a consequence of social and economic conditions in developed countries, more specifically, in Canada and the UK. This article is persuasive, informative, and therefore successful at explaining some of the reasons for the prolonged transition into adulthood because of the professional tone and overall empathy of the authors and the abundant use of statistics throughout the article.</p><p>The professional tone of this article can be seen in the ways Côté and Bynner empathize with Arnett. The authors state through this article that they are voicing their \"scepticism about the utility and applicability of the EA (Emerging Adulthood)\" (Côté and Bynner, 252), however are empathetic and understanding to those who have adopted this EA model because those who adopt the EA model realise \"the transition to adulthood has changed and are looking for a useful metaphor for what is different from the past.\" (Côté and Bynner, 252) This professional tone can also be seen in the ways in which the authors disagree with Arnett, then accompany said disagreements with facts. One opposition that Côté and Bynner have with Arnett's EA model is that it implies that this prolonging of transition into adulthood started only recently. (Côté and Bynner, 253-254) Côté and Bynner state that this prolonging has been \"occurring in much of its present form throughout the latter half of the twentieth century.\" (Côté and Bynner, 254) The two authors then cite two articles written in 1995 stating that the transition time to adulthood is increasing, and has been increasing, followed by one written in 2007 by Warren Clark stating these transitions have been \"'changed or delayed' since 1971\". (Côté and Bynner, 254) Côté and Bynner do an excellent job refuting Arnett's arguments in a professional and empathetic way, thus increasing the persuasiveness of the article.</p><p>The use of statistics in this article reinforces the informative nature of this article. Côté and Bynner argue that the extended transition to adulthood has much to do with the circumstances and experiences of the individual. (Côté and Bynner, 256) Côté and Bynner proceed to support this claim by referring to the series of British cohort studies: the National Survey of Health. Two figures are shown presenting the impact that the academic success of the parents have on the child’s likeliness to achieve a university or college degree and the child's likeliness to experience a temporary suspension from school, respectively. This collected data directly serves to illustrate the ways in which extended transition to adulthood is affected by the circumstances to which the current generation is exposed. Côté and Bynner also state that young people are not choosing to \"evade adult commitments\" but are waiting \"until these commitments can be responsibly made from a position of financial security\" (Côté and Bynner, 259) Once again, this claim is backed up by looking at the average individual annual income in 2004 collected by Statistics Canada in 2006. Upon viewing this data, it can be noted that the average income of those in their early twenties is below the poverty line in a city with a population of 500,000 or more. (Côté and Bynner, 259) Once again, this fact directly serves to defending the argument that young people are subject to their circumstances. Côté and Bynner provide highly relevant and accredited statistics to support their arguments, demonstrating the article is indeed, to a high degree, informative.</p><p>James Côté and John M. Bynner's article <em>Changes in the transition to adulthood in the UK and Canada: the role of agency in emerging adulthood</em> presents many arguments against a new developmental stage called Emerging Adulthood. I believe this article is highly successful at arguing against such a conception due to the professional tone that Côté and Bynner have when opposing Arnett and the informative use of facts and statistics to support their beliefs. This article is well worth the read if you are a young person trying to formulate arguments against older generations about your lack of motivation to start being an adult.</p>" 


  }
]
